solidMechanicsTutorials/icoFsiElasticNonLinULSolidFoam/HronTurekFsi/fluid/system/fvSolution
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

	p
	{
		solver          GAMG;
    		tolerance       1e-06;
    		relTol          0;
    		minIter         1;
    		maxIter         1000;
    		smoother        GaussSeidel;
    		nPreSweeps      0;
    		nPostSweeps     2;
    		nFinestSweeps   2;
    		scaleCorrection true;
    		directSolveCoarsest false;
    		cacheAgglomeration true;
    		nCellsInCoarsestLevel 20;
    		agglomerator    faceAreaPair;
    		mergeLevels     1;
	};

	cellMotionU
    	{
		solver          GAMG;
        	tolerance        1e-6;
        	relTol           1e-3;
        	minIter          1;
        	maxIter          1000;

        	smoother         GaussSeidel;
        	nPreSweeps       0;
        	nPostSweeps      2;
        	nFinestSweeps    2;
		
        	scaleCorrection true;
        	directSolveCoarsest false;
				   		      
        	 cacheAgglomeration true;

		 nCellsInCoarsestLevel 20;
        	 agglomerator     faceAreaPair;
        	 mergeLevels      1;
        };

    	U
    	{
		solver PBiCG;
		preconditioner   DILU;
        	tolerance        1e-06;
        	relTol           0;
    	};
}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 1;
    nOuterCorrectors 50;
    ddtPhiCorr no;
}


// ************************************************************************* //
